In [3]:
import pandas as pd
import numpy as np

# Pandas Series

In [7]:
data = np.array(['a','b','c','d','e'])
s = pd.Series(data)

In [ ]:
print(s3[])

In [8]:
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [11]:
s1 = pd.Series(data,index=[100,101,102,103,104])
s1

100    a
101    b
102    c
103    d
104    e
dtype: object

In [15]:
data1 ={'a':9,'b':90}
s2  = pd.Series(data1)
s2

a     9
b    90
dtype: int64

In [16]:
s3 = pd.Series(5,index=[1,2,3,4,5,6,7])
s3

1    5
2    5
3    5
4    5
5    5
6    5
7    5
dtype: int64

In [18]:
print(s3[4])

5

In [19]:
print(s3[:3])

1    5
2    5
3    5
dtype: int64

# Pandas Dataframe
### pandas.DataFrame( data, index, columns, dtype, copy)

In [24]:
data = [1,2,3,4,5,6]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [29]:
data1 = [["Alex",10],["Nimritee",23],["Bhargavi",24]]
df1 = pd.DataFrame(data1,columns=["Name","Age"])
df1

       Name  Age
0      Alex   10
1  Nimritee   23
2  Bhargavi   24

In [32]:
df2 = pd.DataFrame(data1,columns=["Name","Years"],dtype=float)
df2

       Name  Years
0      Alex   10.0
1  Nimritee   23.0
2  Bhargavi   24.0

In [34]:
data2 = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df3 = pd.DataFrame(data2)
df3

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [38]:
df4 = pd.DataFrame(data2,index=["rank2","rank3","rank4","ty"])
df4

        Name  Age
rank2    Tom   28
rank3   Jack   34
rank4  Steve   29
ty     Ricky   42

In [39]:
data4 = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df5 = pd.DataFrame(data4)
df5

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [41]:
del df5['c'] ## Removes the column forever 
df5

   a   b
0  1   2
1  5  10

In [46]:
store = df5.pop('b') ## Removes the row from df, and returns the removed value
store

0     2
1    10
Name: b, dtype: int64

#### Rows can be selected by passing row label to a loc function.

In [52]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
    'three' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df6 = pd.DataFrame(d)
df6

   one  two  three
a  1.0    1      1
b  2.0    2      2
c  3.0    3      3
d  NaN    4      4

In [54]:
value = df6.loc['d']
value

one      NaN
two      4.0
three    4.0
Name: d, dtype: float64

#### Rows can be selected by passing integer location to an iloc function.

In [57]:
df6.iloc[3]

one      NaN
two      4.0
three    4.0
Name: d, dtype: float64

#### Slice Rows : Multiple rows can be selected using ‘ : ’ operator.

In [60]:
df6[1:3]

   one  two  three
b  2.0    2      2
c  3.0    3      3

In [59]:
df6

   one  two  three
a  1.0    1      1
b  2.0    2      2
c  3.0    3      3
d  NaN    4      4

In [61]:
df6.drop(0)

KeyError: '[0] not found in axis'